arch/src/Documents/РасчетРецепта/РасчетРецепта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетРецепта</name>
  <attributes>
    <name>КоличествоИтераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗатратыЗолото</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляШтуки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтимостьПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатратыРемонтнаяРепутация</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляШтуки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтимостьПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатратыОчкиРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляШтуки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтимостьПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получили</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

arch/src/Documents/РасчетРецепта/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗатратыЗолотоПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыЗолото");
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыРемонтнаяРепутацияПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыРемонтнаяРепутация");
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыОчкиРаботыПриИзменении(Элемент)
	
	ПересчитатьТекущуюСтрокуТабЧасти("ЗатратыОчкиРаботы");
	 
КонецПроцедуры

&НаКлиенте
Процедура КоличествоИтерацийПриИзменении(Элемент)
	КоличествоИтерацийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоличествоИтерацийПриИзмененииНаСервере()
	ПересчитатьТабЧасть("ЗатратыЗолото");
	ПересчитатьТабЧасть("ЗатратыРемонтнаяРепутация");
	ПересчитатьТабЧасть("ЗатратыОчкиРаботы");
КонецПроцедуры

Процедура ПересчитатьТабЧасть(ИмяТабчасти)
	Для каждого элем из Объект[ИмяТабчасти] Цикл
		элем.КоличествоДляПартии = Объект.КоличествоИтераций * элем.КоличествоДляШтуки;
		элем.СтимостьПартии 	 = элем.КоличествоДляПартии * элем.Цена; 
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьТекущуюСтрокуТабЧасти(ИмяТабЧасти)
	
	Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляПартии = Объект.КоличествоИтераций * Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляШтуки;
	Элементы[ИмяТабЧасти].ТекущиеДанные.СтимостьПартии 		= Элементы[ИмяТабЧасти].ТекущиеДанные.КоличествоДляПартии* Элементы[ИмяТабЧасти].ТекущиеДанные.Цена;
	
КонецПроцедуры
